#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cloudops-practice/cloudops-practice/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cloudops-practice/cloudops-practice

To view this run in a browser, visit:
https://app.terraform.io/app/andrewdq/cloudops-practice/runs/run-vesYFia6F4RzEe7y

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
data.azurerm_client_config.current: Reading...
module.alerts.data.azurerm_subscription.current: Reading...
module.resource_groups["southeastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg]
module.resource_groups["eastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg]
module.function.azurerm_app_service_plan.function_app_plan: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/serverFarms/traffic-switch-func-plan]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMjIwMzZjMi02YTQ4LTQxODAtYWUyZC1jZmEwZjIzZTBkZjA7b2JqZWN0SWQ9MWRlYmU3NTItZDJhZS00ZTI1LTljMjUtNzc4ZTkzM2U1ZmMwO3N1YnNjcmlwdGlvbklkPTY5NDIxYTAzLWY4ZTYtNGExZS04MWIzLTA3N2FhZWVhNWNlNzt0ZW5hbnRJZD0xNGJhMzgwYi1iOTNhLTRmYzEtYjRlZi04MDM5Y2NhNjFkNzU=]
data.azuread_service_principal.current: Reading...
module.function.azurerm_function_app.function_app_python: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/sites/traffic-switch-func]
data.azuread_service_principal.current: Read complete after 0s [id=1debe752-d2ae-4e25-9c25-778e933e5fc0]
module.alerts.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.OperationalInsights/workspaces/shared-laworkspace]
module.primary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet]
azurerm_postgresql_flexible_server.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql]
module.traffic-manager.azurerm_traffic_manager_profile.tm_profile: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm]
module.alerts.azurerm_monitor_action_group.alerts: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-roadmap-maker]
module.secondary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet]
module.function.azurerm_storage_account.function_app_storage: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Storage/storageAccounts/trafficswitchfuncsa]
module.secondary_network.azurerm_network_security_group.aks_nsg: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg]
module.primary_network.azurerm_network_security_group.aks_nsg: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg]
module.secondary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.secondary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/app]
module.alerts.azurerm_consumption_budget_subscription.budget: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/providers/Microsoft.Consumption/budgets/roadmap-maker-annual-budget]
module.primary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app]
module.primary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_network.azurerm_network_security_rule.aks_inbound["3000"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg/securityRules/allow-aks-inbound-port-3000]
module.primary_network.azurerm_network_security_rule.aks_inbound["80"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg/securityRules/allow-aks-inbound-port-80]
module.primary_network.azurerm_network_security_rule.aks_inbound["5137"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg/securityRules/allow-aks-inbound-port-5137]
module.secondary_network.azurerm_network_security_rule.aks_inbound["3000"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg/securityRules/allow-aks-inbound-port-3000]
module.secondary_network.azurerm_network_security_rule.aks_inbound["5137"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg/securityRules/allow-aks-inbound-port-5137]
module.secondary_network.azurerm_network_security_rule.aks_inbound["80"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg/securityRules/allow-aks-inbound-port-80]
azurerm_postgresql_flexible_server_database.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/databases/roadmap_maker]
azurerm_postgresql_flexible_server_firewall_rule.aks_subnet: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAKSSubnet]
azurerm_postgresql_flexible_server_active_directory_administrator.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/administrators/1debe752-d2ae-4e25-9c25-778e933e5fc0]
azurerm_postgresql_flexible_server_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAzureServices]
module.secondary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.primary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.traffic-manager.azurerm_traffic_manager_external_endpoint.endpoints["primary-endpoint"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm/ExternalEndpoints/primary-endpoint]
module.traffic-manager.azurerm_traffic_manager_external_endpoint.endpoints["secondary-endpoint"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm/ExternalEndpoints/secondary-endpoint]
module.secondary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks]
module.primary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks]
module.function.azurerm_storage_container.function_code: Refreshing state... [id=https://trafficswitchfuncsa.blob.core.windows.net/function-releases]
module.function.azurerm_storage_blob.function_zip: Refreshing state... [id=https://trafficswitchfuncsa.blob.core.windows.net/function-releases/function-code.zip]
module.primary_monitoring.azurerm_monitor_action_group.failover: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-failover-func]
module.primary_monitoring.azurerm_monitor_diagnostic_setting.aks_diagnostics: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks|roadmap-maker-primary-aks-diagnostics]
module.primary_monitoring.azurerm_monitor_metric_alert.node_not_ready: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/metricAlerts/roadmap-maker-primary-aks-node-not-ready]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.function.azurerm_storage_blob.function_zip has been deleted
  - resource "azurerm_storage_blob" "function_zip" {
        id                     = "https://trafficswitchfuncsa.blob.core.windows.net/function-releases/function-code.zip"
      - name                   = "function-code.zip" -> null
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.function.data.azurerm_storage_account_blob_container_sas.function_zip_sas will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_blob_container_sas" "function_zip_sas" {
      + connection_string = (sensitive value)
      + container_name    = "function-releases"
      + expiry            = "2030-01-01T00:00:00Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add    = false
          + create = false
          + delete = false
          + list   = false
          + read   = true
          + write  = false
        }
    }

  # module.function.azurerm_app_service_plan.function_app_plan will be destroyed
  # (because azurerm_app_service_plan.function_app_plan is not in configuration)
  - resource "azurerm_app_service_plan" "function_app_plan" {
      - id                           = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/serverFarms/traffic-switch-func-plan" -> null
      - is_xenon                     = false -> null
      - kind                         = "functionapp" -> null
      - location                     = "southeastasia" -> null
      - maximum_elastic_worker_count = 1 -> null
      - maximum_number_of_workers    = 0 -> null
      - name                         = "traffic-switch-func-plan" -> null
      - per_site_scaling             = false -> null
      - reserved                     = true -> null
      - resource_group_name          = "roadmap-maker-southeastasia-rg" -> null
      - tags                         = {} -> null
      - zone_redundant               = false -> null
        # (1 unchanged attribute hidden)

      - sku {
          - capacity = 0 -> null
          - size     = "Y1" -> null
          - tier     = "Dynamic" -> null
        }
    }

  # module.function.azurerm_function_app.function_app_python will be destroyed
  # (because azurerm_function_app.function_app_python is not in configuration)
  - resource "azurerm_function_app" "function_app_python" {
      - app_service_plan_id             = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/serverFarms/traffic-switch-func-plan" -> null
      - app_settings                    = {
          - "APPINSIGHTS_INSTRUMENTATIONKEY"        = "f21ab7a0-b8da-4ef9-961b-2ba64ad98586"
          - "APPLICATIONINSIGHTS_CONNECTION_STRING" = "InstrumentationKey=f21ab7a0-b8da-4ef9-961b-2ba64ad98586;IngestionEndpoint=https://southeastasia-1.in.applicationinsights.azure.com/;LiveEndpoint=https://southeastasia.livediagnostics.monitor.azure.com/;ApplicationId=fe96daef-39ed-427e-bea9-601e0ca13091"
          - "AzureWebJobsStorage"                   = (sensitive value)
          - "ENABLE_ORYX_BUILD"                     = "1"
          - "FUNCTIONS_EXTENSION_VERSION"           = "~4"
          - "FUNCTIONS_WORKER_RUNTIME"              = "python"
          - "PROFILE_NAME"                          = "roadmap-maker-tm"
          - "RESOURCE_GROUP"                        = "roadmap-maker-southeastasia-rg"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"        = "1"
          - "SUBSCRIPTION_ID"                       = "69421a03-f8e6-4a1e-81b3-077aaeea5ce7"
        } -> null
      - custom_domain_verification_id   = "AEF08FCA1D0979CF1E5B3392CA1A1D3488472EF20B71C629EF40EADDA153322E" -> null
      - daily_memory_time_quota         = 0 -> null
      - default_hostname                = "traffic-switch-func.azurewebsites.net" -> null
      - enable_builtin_logging          = true -> null
      - enabled                         = true -> null
      - https_only                      = false -> null
      - id                              = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/sites/traffic-switch-func" -> null
      - key_vault_reference_identity_id = "SystemAssigned" -> null
      - kind                            = "functionapp,linux" -> null
      - location                        = "southeastasia" -> null
      - name                            = "traffic-switch-func" -> null
      - os_type                         = "linux" -> null
      - outbound_ip_addresses           = "52.187.129.179,52.187.23.154,52.163.123.89,52.230.18.200,52.187.36.104" -> null
      - possible_outbound_ip_addresses  = "52.187.129.179,52.187.23.154,52.163.123.89,52.230.18.200,20.184.9.149,20.191.136.243,20.198.207.165,20.247.250.201,20.247.250.206,20.247.251.4,20.247.251.8,20.247.251.86,20.198.149.164,20.198.150.197,20.198.150.247,20.198.151.0,20.198.151.3,20.198.151.20,52.187.36.104" -> null
      - resource_group_name             = "roadmap-maker-southeastasia-rg" -> null
      - site_credential                 = [
          - {
              - password = "LM9i1Ec2HrcTmvy0dLkjZxk4sHHQqb0aRHGRT9X8Ksj9DMMfey73Xl8A0t4K"
              - username = "$traffic-switch-func"
            },
        ] -> null
      - storage_account_access_key      = (sensitive value) -> null
      - storage_account_name            = "trafficswitchfuncsa" -> null
      - tags                            = {
          - "hidden-link: /app-insights-resource-id" = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/microsoft.insights/components/traffic-switch-func202508251022"
        } -> null
      - version                         = "~4" -> null
        # (1 unchanged attribute hidden)

      - auth_settings {
          - additional_login_params        = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - enabled                        = false -> null
          - token_refresh_extension_hours  = 0 -> null
          - token_store_enabled            = false -> null
            # (4 unchanged attributes hidden)
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "5ca9e129-309a-4957-943b-22e950979113" -> null
          - tenant_id    = "14ba380b-b93a-4fc1-b4ef-8039cca61d75" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                        = false -> null
          - app_scale_limit                  = 0 -> null
          - dotnet_framework_version         = "v4.0" -> null
          - elastic_instance_minimum         = 1 -> null
          - ftps_state                       = "FtpsOnly" -> null
          - http2_enabled                    = false -> null
          - ip_restriction                   = [] -> null
          - linux_fx_version                 = "PYTHON|3.9" -> null
          - min_tls_version                  = "1.2" -> null
          - pre_warmed_instance_count        = 0 -> null
          - runtime_scale_monitoring_enabled = false -> null
          - scm_ip_restriction               = [] -> null
          - scm_type                         = "GitHubAction" -> null
          - scm_use_main_ip_restriction      = false -> null
          - use_32_bit_worker_process        = false -> null
          - vnet_route_all_enabled           = false -> null
          - websockets_enabled               = false -> null
            # (3 unchanged attributes hidden)

          - cors {
              - allowed_origins     = [
                  - "*",
                ] -> null
              - support_credentials = false -> null
            }
        }

      - source_control {
          - branch             = "feature/azure-function-traffic-routing" -> null
          - manual_integration = false -> null
          - repo_url           = "https://github.com/SVUIT/cloudops-practice" -> null
          - rollback_enabled   = false -> null
          - use_mercurial      = false -> null
        }
    }

  # module.function.azurerm_linux_function_app.function_app will be created
  + resource "azurerm_linux_function_app" "function_app" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "southeastasia"
      + name                                           = "traffic-switch-func"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "roadmap-maker-southeastasia-rg"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "trafficswitchfuncsa"
      + storage_uses_managed_identity                  = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.11"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.function.azurerm_service_plan.function_app_plan will be created
  + resource "azurerm_service_plan" "function_app_plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "southeastasia"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "traffic-switch-func-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "roadmap-maker-southeastasia-rg"
      + sku_name                     = "Y1"
      + worker_count                 = (known after apply)
    }

  # module.function.azurerm_storage_blob.function_zip will be created
  + resource "azurerm_storage_blob" "function_zip" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "function-code.zip"
      + parallelism            = 8
      + size                   = 0
      + source                 = "modules/function/../../../function-code.zip"
      + storage_account_name   = "trafficswitchfuncsa"
      + storage_container_name = "function-releases"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.function.azurerm_storage_container.function_code will be updated in-place
  ~ resource "azurerm_storage_container" "function_code" {
      ~ container_access_type             = "container" -> "private"
        id                                = "https://trafficswitchfuncsa.blob.core.windows.net/function-releases"
        name                              = "function-releases"
        # (7 unchanged attributes hidden)
    }

  # module.primary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks"
        name                                = "roadmap-maker-primary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "primary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "primary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "primary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "primary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.primary_monitoring.azurerm_monitor_action_group.failover will be updated in-place
  ~ resource "azurerm_monitor_action_group" "failover" {
        id                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-failover-func"
        name                = "ag-failover-func"
        tags                = {}
        # (4 unchanged attributes hidden)

      ~ webhook_receiver {
            name                    = "failover-func"
          ~ service_uri             = "https://traffic-switch-func.azurewebsites.net/api/FailoverTrigger" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.secondary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks"
        name                                = "roadmap-maker-secondary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "secondary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "secondary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "secondary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "secondary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 4 to change, 2 to destroy.
╷
│ Error: retrieving Administrator (Subscription: "69421a03-f8e6-4a1e-81b3-077aaeea5ce7"
│ Resource Group Name: "roadmap-maker-southeastasia-rg"
│ Flexible Server Name: "roadmap-maker-southeastasia-psql"
│ Object: "1debe752-d2ae-4e25-9c25-778e933e5fc0"): Get "https://management.azure.com/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/administrators/1debe752-d2ae-4e25-9c25-778e933e5fc0?api-version=2022-12-01": context deadline exceeded
│ 
│   with azurerm_postgresql_flexible_server_active_directory_administrator.primary,
│   on main.tf line 205, in resource "azurerm_postgresql_flexible_server_active_directory_administrator" "primary":
│  205: resource "azurerm_postgresql_flexible_server_active_directory_administrator" "primary" {
│ 
╵
╷
│ Error: retrieving Database (Subscription: "69421a03-f8e6-4a1e-81b3-077aaeea5ce7"
│ Resource Group Name: "roadmap-maker-southeastasia-rg"
│ Flexible Server Name: "roadmap-maker-southeastasia-psql"
│ Database Name: "roadmap_maker"): unexpected status 400 (400 Bad Request) with error: ServerStoppedError: Server 'roadmap-maker-southeastasia-psql' is in 'Stopped' state. Start the server and try the operation again.
│ 
│   with azurerm_postgresql_flexible_server_database.primary,
│   on main.tf line 215, in resource "azurerm_postgresql_flexible_server_database" "primary":
│  215: resource "azurerm_postgresql_flexible_server_database" "primary" {
│ 
╵
Operation failed: failed running terraform plan (exit 1)
::error::Terraform exited with code 1.

```

</details>

*Pushed by: @Thanh8804, Action: `pull_request`*